#
# .zplugins.txt – Antidote plugins file (rewritten for efficiency & stability)
#

# ------------------------------------------------------------------------------
# CORE ENVIRONMENT SETUP (load first, no defer)
# ------------------------------------------------------------------------------

"$ZSH_CUSTOM"/plugins/xdg
mattmc3/zephyr path:plugins/history
mattmc3/zephyr path:plugins/environment
mattmc3/zephyr path:plugins/homebrew
"$ZSH_CUSTOM"/plugins/dotfiles

# ------------------------------------------------------------------------------
# OMZ + COMPLETIONS
# ------------------------------------------------------------------------------

zsh-users/zsh-completions kind:fpath path:src
getantidote/use-omz

# ------------------------------------------------------------------------------
# CRITICAL OH-MY-ZSH LIBRARIES (sourced early, no defer)
# ------------------------------------------------------------------------------

ohmyzsh/ohmyzsh path:lib/async_prompt.zsh
ohmyzsh/ohmyzsh path:lib/completion.zsh #conditional:is-not-warpterm
#ohmyzsh/ohmyzsh path:lib/directories.zsh
ohmyzsh/ohmyzsh path:lib/key-bindings.zsh # conditional:is-not-warpterm
ohmyzsh/ohmyzsh path:lib/termsupport.zsh

# ------------------------------------------------------------------------------
# NON-CRITICAL OH-MY-ZSH LIBRARIES (safe to defer)
# ------------------------------------------------------------------------------

ohmyzsh/ohmyzsh path:lib/bzr.zsh
ohmyzsh/ohmyzsh path:lib/cli.zsh
ohmyzsh/ohmyzsh path:lib/clipboard.zsh
ohmyzsh/ohmyzsh path:lib/compfix.zsh
ohmyzsh/ohmyzsh path:lib/correction.zsh
ohmyzsh/ohmyzsh path:lib/diagnostics.zsh
ohmyzsh/ohmyzsh path:lib/functions.zsh
ohmyzsh/ohmyzsh path:lib/git.zsh
ohmyzsh/ohmyzsh path:lib/grep.zsh
ohmyzsh/ohmyzsh path:lib/history.zsh
ohmyzsh/ohmyzsh path:lib/misc.zsh
ohmyzsh/ohmyzsh path:lib/nvm.zsh
ohmyzsh/ohmyzsh path:lib/prompt_info_functions.zsh
ohmyzsh/ohmyzsh path:lib/spectrum.zsh
ohmyzsh/ohmyzsh path:lib/theme-and-appearance.zsh
ohmyzsh/ohmyzsh path:lib/vcs_info.zsh

# ------------------------------------------------------------------------------
# DEV TOOLS (safe to defer)
# ------------------------------------------------------------------------------

ohmyzsh/ohmyzsh path:plugins/mise
ohmyzsh/ohmyzsh path:plugins/git
"$ZSH_CUSTOM"/plugins/python
"$ZSH_CUSTOM"/plugins/ruby


# ------------------------------------------------------------------------------
# NON-CRITICAL ZEPHYR PLUGINS (safe to defer)
# ----------------------------s--------------------------------------------------

# These are consolidated and organized by priority
mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/compstyle
mattmc3/zephyr path:plugins/directory
mattmc3/zephyr path:plugins/helper
mattmc3/zephyr path:plugins/prompt
"$ZSH_CUSTOM"/themes kind:fpath
mattmc3/zephyr path:plugins/utility
mattmc3/zephyr path:plugins/editor # conditional:is-not-warpterm
mattmc3/zephyr path:plugins/zfunctions
mattmc3/zephyr path:plugins/macos

# ------------------------------------------------------------------------------
# UTILITIES (safe to defer)
# ------------------------------------------------------------------------------

ohmyzsh/ohmyzsh path:plugins/ssh-agent
ohmyzsh/ohmyzsh path:plugins/zoxide
ohmyzsh/ohmyzsh path:plugins/copypath
ohmyzsh/ohmyzsh path:plugins/common-aliases
#romkatv/zsh-bench kind:path
marlonrichert/zsh-hist
romkatv/zsh-no-ps2
agkozak/zhooks
# LoganPederson/vibe

# ------------------------------------------------------------------------------
# FINAL PLUGINS (loaded last, no defer unless known-safe)
# ------------------------------------------------------------------------------

"$ZSH_CUSTOM"/plugins/aliases
mattmc3/zephyr path:plugins/confd
zsh-users/zsh-autosuggestions conditional:is-not-warpterm post:post-autosuggestions
zsh-users/zsh-history-substring-search conditional:is-not-warpterm post:post-history-substring-search
zsh-users/zsh-syntax-highlighting conditional:is-not-warpterm  # DO NOT DEFER

# vi: ft=properties
