#
# .zplugins.txt – Antidote plugins file (optimized for performance)
#

# ------------------------------------------------------------------------------
# CORE ENVIRONMENT SETUP (load first, no defer)
# ------------------------------------------------------------------------------

"$ZSH_CUSTOM"/plugins/xdg
mattmc3/zephyr path:plugins/history
mattmc3/zephyr path:plugins/environment
"$ZSH_CUSTOM"/plugins/homebrew
"$ZSH_CUSTOM"/plugins/dotfiles

# ------------------------------------------------------------------------------
# COMPLETIONS & OMZ
# ------------------------------------------------------------------------------

zsh-users/zsh-completions kind:fpath path:src
getantidote/use-omz

# ------------------------------------------------------------------------------
# CRITICAL OH-MY-ZSH LIBRARIES (sourced early, no defer)
# ------------------------------------------------------------------------------

ohmyzsh/ohmyzsh path:lib/async_prompt.zsh
ohmyzsh/ohmyzsh path:lib/completion.zsh #conditional:is-not-warpterm
#ohmyzsh/ohmyzsh path:lib/directories.zsh
ohmyzsh/ohmyzsh path:lib/key-bindings.zsh # conditional:is-not-warpterm
ohmyzsh/ohmyzsh path:lib/termsupport.zsh

# ------------------------------------------------------------------------------
# NON-CRITICAL OH-MY-ZSH LIBRARIES (deferred loading)
# ------------------------------------------------------------------------------

# Core functionality - defer level 1
ohmyzsh/ohmyzsh path:lib/functions.zsh kind:defer
ohmyzsh/ohmyzsh path:lib/git.zsh kind:defer
ohmyzsh/ohmyzsh path:lib/grep.zsh kind:defer
ohmyzsh/ohmyzsh path:lib/history.zsh kind:defer
ohmyzsh/ohmyzsh path:lib/misc.zsh kind:defer
ohmyzsh/ohmyzsh path:lib/prompt_info_functions.zsh kind:defer
ohmyzsh/ohmyzsh path:lib/spectrum.zsh kind:defer
ohmyzsh/ohmyzsh path:lib/theme-and-appearance.zsh kind:defer
ohmyzsh/ohmyzsh path:lib/vcs_info.zsh kind:defer

# Rarely used libraries - defer level 2 (commented out for performance)
# ohmyzsh/ohmyzsh path:lib/bzr.zsh defer:2
# ohmyzsh/ohmyzsh path:lib/cli.zsh defer:2
# ohmyzsh/ohmyzsh path:lib/clipboard.zsh defer:2
# ohmyzsh/ohmyzsh path:lib/compfix.zsh defer:2
# ohmyzsh/ohmyzsh path:lib/correction.zsh defer:2
# ohmyzsh/ohmyzsh path:lib/diagnostics.zsh defer:2

# ------------------------------------------------------------------------------
# DEV TOOLS (deferred loading)
# ------------------------------------------------------------------------------

# Core dev tools - defer level 1
"$ZSH_CUSTOM"/plugins/python kind:defer
"$ZSH_CUSTOM"/plugins/ruby kind:defer

# Commented out mise plugin (handled by homebrew plugin)
# ohmyzsh/ohmyzsh path:plugins/mise defer:2


# ------------------------------------------------------------------------------
# NON-CRITICAL ZEPHYR PLUGINS (deferred loading)
# ------------------------------------------------------------------------------

# Core zephyr plugins - defer level 1
mattmc3/zephyr path:plugins/color kind:defer
mattmc3/zephyr path:plugins/compstyle kind:defer
mattmc3/zephyr path:plugins/directory kind:defer
mattmc3/zephyr path:plugins/helper kind:defer
mattmc3/zephyr path:plugins/prompt kind:defer
"$ZSH_CUSTOM"/themes kind:fpath
mattmc3/zephyr path:plugins/utility kind:defer
mattmc3/zephyr path:plugins/editor kind:defer # conditional:is-not-warpterm
mattmc3/zephyr path:plugins/zfunctions kind:defer
mattmc3/zephyr path:plugins/macos kind:defer

# ------------------------------------------------------------------------------
# UTILITIES (deferred loading)
# ------------------------------------------------------------------------------

# Core utilities - defer level 1
ohmyzsh/ohmyzsh path:plugins/ssh-agent kind:defer
ohmyzsh/ohmyzsh path:plugins/zoxide kind:defer
ohmyzsh/ohmyzsh path:plugins/copypath kind:defer
ohmyzsh/ohmyzsh path:plugins/common-aliases kind:defer

# Performance utilities - defer level 2
marlonrichert/zsh-hist kind:defer
romkatv/zsh-no-ps2 kind:defer
agkozak/zhooks kind:defer

# Commented out experimental/benchmarking tools
#romkatv/zsh-bench kind:path defer:3
# LoganPederson/vibe defer:3

# ------------------------------------------------------------------------------
# FINAL PLUGINS (loaded last, no defer unless known-safe)
# ------------------------------------------------------------------------------

"$ZSH_CUSTOM"/plugins/aliases
mattmc3/zephyr path:plugins/confd
# zsh-users/zsh-autosuggestions conditional:is-not-warpterm post:post-autosuggestions
# zsh-users/zsh-history-substring-search conditional:is-not-warpterm post:post-history-substring-search
# zsh-users/zsh-syntax-highlighting conditional:is-not-warpterm  # DO NOT DEFER

# vi: ft=properties
