adguard.adblock
alefragnani.project-manager
aspel.github-sync-fork
bmalehorn.shell-syntax
chouzz.vscode-better-align
christian-kohler.path-intellisense
chrmarti.regex
codezombiech.gitignore
continue.continue
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
dennykorsukewitz.githubfilefetcher
donjayamanne.githistory
dorianmassoulier.repomix-runner
dotiful.dotfiles-syntax-highlighting
eamodio.gitlens
editorconfig.editorconfig
edwinhuish.better-comments-next
edwinkofler.vscode-assorted-languages
esbenp.prettier-vscode
fabiospampinato.vscode-diff
foxundermoon.shell-format
fralle.copy-code-context
gitguardian-secret-security.gitguardian
github.copilot
github.copilot-chat
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
google.gemini-cli-vscode-ide-companion
google.geminicodeassist
guttih.sheller
henriquebruno.github-repository-manager
hverlin.mise-vscode
idleberg.applescript
interactive-smartlog.interactive-smartlog
irongeek.vscode-env
janisdd.vscode-edit-csv
jeff-hykin.better-shellscript-syntax
jmallien.replacewithnewline
kennylong.kubernetes-yaml-formatter
kingleo.quickdraw
l13rary.l13-sh-snippets
ldez.ignore-files
lonr.sort-settings-json
maciejdems.add-to-gitignore
mads-hartmann.bash-ide-vscode
miguelsolorio.symbols
mkhl.shfmt
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.vscode-commander
ms-vscode.vscode-websearchforcopilot
ms-windows-ai-studio.windows-ai-studio
mxthevs.one-dark-pro-monokai-darker-reloaded
oderwat.indent-rainbow
oliverdantzer.file-structure-tree
openai.chatgpt
polymermallard.box-comment
ragokan.vscode-ai-context-provider
remcohaszing.schemastore
richie5um2.vscode-sort-json
ronco-jhon.better-context-to-ai
rpinski.shebang-snippets
ryu1kn.partial-diff
saoudrizwan.claude-dev
shaharkazaz.git-merger
shd101wyy.markdown-preview-enhanced
shellomo.enhanced-toml
sidneys1.gitconfig
sleistner.vscode-fileutils
specstory.specstory-vscode
stevebeauge.quick-toggle-hide-ignored-files
tamasfe.even-better-toml
the0807.uv-toolkit
timonwong.shellcheck
tkoresearch.applescript-support
usernamehw.errorlens
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vrocky.git-scan-fix
vsls-contrib.gitdoc
waseemakram.bashnsippets
wenfangdu.snippet-generator
yatki.vscode-surround
yy0931.gitconfig-lsp
yzhang.markdown-all-in-one
zokugun.cron-tasks
zokugun.sync-settings
