6o8.workspace-control
alefragnani.project-manager
bodil.prettier-toml
chouzz.vscode-better-align
christian-kohler.path-intellisense
codesmith.markdown-inline-editor-vscode
contradiction29.obsidian-vscode-extension
darkriszty.markdown-table-prettify
davidanson.vscode-markdownlint
dcog989.indent-spectra
donjayamanne.githistory
dorianmassoulier.repomix-runner
editorconfig.editorconfig
edwinhuish.better-comments-next
esbenp.prettier-vscode
geoffreyolsonjr.obsidian-navigation
github.copilot
github.copilot-chat
hverlin.mise-vscode
kortina.vscode-markdown-notes
ldez.ignore-files
lonr.sort-settings-json
miguelsolorio.symbols
moshfeu.diff-merge
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode.remote-repositories
ms-vscode.vscode-websearchforcopilot
ms-windows-ai-studio.windows-ai-studio
mxthevs.one-dark-pro-monokai-darker-reloaded
openai.chatgpt
pimzino.agentic-tools-mcp-companion
qcz.text-power-tools
ragokan.vscode-ai-context-provider
remcohaszing.schemastore
richie5um2.vscode-sort-json
ronco-jhon.better-context-to-ai
ryu1kn.partial-diff
saoudrizwan.claude-dev
sleistner.vscode-fileutils
specstory.specstory-vscode
stevebeauge.quick-toggle-hide-ignored-files
svsool.markdown-memo
tahabasri.snippets
the0807.uv-toolkit
tombi-toml.tombi
usernamehw.errorlens
willasm.obsidian-md-vsc
yatki.vscode-surround
yzhang.markdown-all-in-one
zokugun.cron-tasks
