adguard.adblock
aspel.github-sync-fork
bmalehorn.shell-syntax
chouzz.vscode-better-align
chrmarti.regex
davidanson.vscode-markdownlint
dennykorsukewitz.githubfilefetcher
donjayamanne.githistory
dotiful.dotfiles-syntax-highlighting
dual.zsh-completion-script
eamodio.gitlens
editorconfig.editorconfig
edwinhuish.better-comments-next
edwinkofler.vscode-assorted-languages
esbenp.prettier-vscode
fabiospampinato.vscode-diff
foxundermoon.shell-format
gitguardian-secret-security.gitguardian
github.remotehub
guttih.sheller
henriquebruno.github-repository-manager
hverlin.mise-vscode
idleberg.applescript
jeff-hykin.better-shellscript-syntax
jmallien.replacewithnewline
l13rary.l13-sh-snippets
ldez.ignore-files
lonr.sort-settings-json
lunarlimbo.banner-comments-plus
maciejdems.add-to-gitignore
mads-hartmann.bash-ide-vscode
mhutchie.git-graph
miguelsolorio.symbols
mkhl.shfmt
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode.remote-repositories
ms-windows-ai-studio.windows-ai-studio
mxthevs.one-dark-pro-monokai-darker-reloaded
oderwat.indent-rainbow
oliverdantzer.file-structure-tree
openai.chatgpt
polymermallard.box-comment
remcohaszing.schemastore
rooveterinaryinc.roo-cline
rpinski.shebang-snippets
ryu1kn.partial-diff
saoudrizwan.claude-dev
shaharkazaz.git-merger
shellomo.enhanced-toml
sleistner.vscode-fileutils
specstory.specstory-vscode
stevebeauge.quick-toggle-hide-ignored-files
tamasfe.even-better-toml
timonwong.shellcheck
tkoresearch.applescript-support
usernamehw.errorlens
waseemakram.bashnsippets
wenfangdu.snippet-generator
yatki.vscode-surround
yy0931.gitconfig-lsp
yzhang.markdown-all-in-one
zokugun.cron-tasks
zokugun.sync-settings
